from ultralytics import YOLO


def plant_select_result(plant_name):
    yolo_class = ['딸기', 
    '토마토', 
    '파프리카', 
    '오이', 
    '고추', 
    '포도', 
    '딸기잿빛곰팡이병_초기', 
    '딸기잿빛곰팡이병_중기',
    '딸기잿빛곰팡이병_말기',
    '딸기흰가루병_초기',
    '딸기흰가루병_중기',
    '딸기흰가루병_말기',
    '오이노균병_초기',
    '오이노균병_중기',
    '오이노균병_말기',
    '오이흰가루병_초기',
    '오이흰가루병_중기',
    '오이흰가루병_말기',
    '토마토흰가루병_초기',
    '토마토흰가루병_중기',
    '토마토흰가루병_말기',
    '토마토잿빛곰팡이병_초기',
    '토마토잿빛곰팡이병_중기',
    '토마토잿빛곰팡이병_말기',
    '고추탄저병_초기',
    '고추탄저병_중기',
    '고추탄저병_말기',
    '고추흰가루병_초기',
    '고추흰가루병_중기',
    '고추흰가루병_말기',
    '파프리카흰가루병_초기',
    '파프리카흰가루병_중기',
    '파프리카흰가루병_말기',
    '파프리카잘록병_초기',
    '파프리카잘록병_중기',
    '파프리카잘록병_말기',
    '시설포도탄저병_초기',
    '시설포도탄저병_중기',
    '시설포도탄저병_말기',
    '시설포도노균병_초기',
    '시설포도노균병_중기',
    '시설포도노균병_말기',
    '냉해피해_초기',
    '냉해피해_중기',
    '냉해피해_말기',
    '열과_초기',
    '열과_중기',
    '열과_말기',
    '칼슘결핍_초기',
    '칼슘결핍_중기',
    '칼슘결핍_말기',
    '일소피해_초기',
    '일소피해_중기',
    '일소피해_말기',
    '축과병_초기',
    '축과병_중기',
    '축과병_말기',
    '다량원소결핍 (N)_초기',
    '다량원소결핍 (N)_중기',
    '다량원소결핍 (N)_말기',
    '다량원소결핍 (P)_초기',
    '다량원소결핍 (P)_중기',
    '다량원소결핍 (P)_말기',
    '다량원소결핍 (K)_초기',
    '다량원소결핍 (K)_중기',
    '다량원소결핍 (K)_말기',
    '딸기잿빛곰팡이병반응_초기',
    '딸기잿빛곰팡이병반응_중기',
    '딸기잿빛곰팡이병반응_말기',
    '딸기흰가루병반응_초기',
    '딸기흰가루병반응_중기',
    '딸기흰가루병반응_말기',
    '오이노균병반응_초기',
    '오이노균병반응_중기',
    '오이노균병반응_말기',
    '오이흰가루병반응_초기',
    '오이흰가루병반응_중기',
    '오이흰가루병반응_말기',
    '토마토흰가루병반응_초기',
    '토마토흰가루병반응_중기',
    '토마토흰가루병반응_말기',
    '토마토잿빛곰팡이병반응_초기',
    '토마토잿빛곰팡이병반응_중기',
    '토마토잿빛곰팡이병반응_말기',
    '고추탄저병반응 _초기',
    '고추탄저병반응 _중기',
    '고추탄저병반응 _말기',
    '파프리카흰가루병반응_초기',
    '파프리카흰가루병반응_중기',
    '파프리카흰가루병반응_말기',
    '시설포도탄저병반응_초기',
    '시설포도탄저병반응_중기',
    '시설포도탄저병반응_말기',
    '시설포도노균병반응_초기',
    '시설포도노균병반응_중기',
    '시설포도노균병반응_말기'
    ]
    # tf
    # 딸기 ['a2', 'a1', 'b1', 'b6', 'b8', 'b7', '0', 'c1', 'c2']
    # 토마토 ['a6', 'a5', 'b8', 'b7', 'b6', 'b3', 'b2', 'c6', 'c5', '0']
    # 파프리카 ['a9', 'a10', 'b8', 'b7', 'b6', 'b3', 'c9', '0']
    # 오이 ['a4', 'a3', 'b8', 'b7', 'b6', 'b1', 'c3', 'c4', '0']
    # 고추 ['a8', 'a7', 'b7', 'b3', 'b6', 'b8', 'c7', '0']
    # 포도 ['a12', 'a11', 'b4', 'b5', '0', 'c12', 'c11']

    disease_dict = {
        '1':{'a2':'딸기흰가루병','a1':'딸기잿빛곰팡이병','b1':'냉해피해','b6':'다량원소결핍 (N)','b8':'다량원소결핍 (K)','b7':'다량원소결핍 (P)','0':'정상','c1':'딸기잿빛곰팡이병반응', 'c2':'딸기흰가루병반응'},
        '2':{'a6':'토마토잿빛곰팡이병','a5':'토마토흰가루병','b8':'다량원소결핍 (K)','b7':'다량원소결핍 (P)','b6':'다량원소결핍 (N)','b3':'칼슘결핍','b2':'열과','c6':'토마토잿빛곰팡이병반응','c5':'토마토흰가루병반응','0':'정상'},
        '3':{'a9':'파프리카흰가루병','a10':'파프리카잘록병','b8':'다량원소결핍 (K)','b7':'다량원소결핍 (P)','b6':'다량원소결핍 (N)','b3':'칼슘결핍','c9':'파프리카흰가루병반응','0':'정상'},
        '4':{'a4':'오이흰가루병','a3':'오이노균병','b8':'다량원소결핍 (K)','b7':'다량원소결핍 (P)','b6':'다량원소결핍 (N)','b1':'냉해피해', 'c3':'오이노균병반응', 'c4':'오이흰가루병반응','0':'정상'},
        '5':{'a8':'고추흰가루병','a7':'고추탄저병','b7':'다량원소결핍 (P)','b3':'칼슘결핍','b6':'다량원소결핍 (N)','b8':'다량원소결핍 (K)','c7':'고추탄저병반응','0':'정상'},
        '6':{'a12':'시설포도노균병','a11':'시설포도탄저병','b4':'일소피해','b5':'축과병','0':'정상','c12':'시설포도노균병반응','c11':'시설포도탄저병반응'}
    }

    if plant_name == '고추':
        disease = disease_dict['5']
        yolo_model = YOLO('yolo_model/pepper.pt')
    elif plant_name == '딸기':
        disease = disease_dict['1']
        yolo_model = YOLO('yolo_model/strawberry.pt')
    elif plant_name == '포도':
        disease = disease_dict['6']
        yolo_model = YOLO('yolo_model/grape.pt')
    elif plant_name == '오이':
        disease = disease_dict['4']
        yolo_model = YOLO('yolo_model/cucumber.pt')
    elif plant_name == '토마토':
        disease = disease_dict['2']
        yolo_model = YOLO('yolo_model/tomato.pt')
    elif plant_name == '파프리카':
        disease = disease_dict['3']
        yolo_model = YOLO('yolo_model/paprika.pt')
                                             
    disease_codes = list(disease.keys())
    disease_codes.append('0')
    disease_names = list(disease.values())    
    disease_items = list(disease.items())
    
    return disease_dict, disease_codes, disease_names, disease_items, yolo_model, yolo_class

